Зарплата_и_Управление_Персоналом/src/Documents/СведенияОНезачисленнойЗарплате/СведенияОНезачисленнойЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СведенияОНезачисленнойЗарплате</name>
  <comment>АПК:93 представления объекта и списка совпадают</comment>
  <registerRecords>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплатеАвансом</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплате</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ведомость</name>
    <type>
      <types>DocumentRef.ВедомостьНаВыплатуЗарплатыПеречислением</types>
      <types>DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</types>
      <types>DocumentRef.ВедомостьПрочихДоходовВБанк</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>АПК:58 Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <comment>АПК:58 физлицо является сотрудником</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Зарплата_и_Управление_Персоналом/src/Documents/СведенияОНезачисленнойЗарплате/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверятьЗарплатныйПроект = ОбменСБанкамиПоЗарплатнымПроектам.ЭтоВедомостьВБанк(Ведомость);
	
	ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомость, "Проведен, Организация" + ?(ПроверятьЗарплатныйПроект, ", ЗарплатныйПроект", ""));
	
	ПроверятьЗарплатныйПроект = ПроверятьЗарплатныйПроект И ЗначениеЗаполнено(ДанныеВедомости.ЗарплатныйПроект);
	
	Если НЕ Ведомость.Проведен Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 не проведен.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	Если ДанныеВедомости.Организация <> Организация Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 относится к другой организации.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	СведенияОНезачисленнойЗарплатеПоВедомости = Документы.СведенияОНезачисленнойЗарплате.ВыбратьПоВедомости(Ведомость, Истина);
	Если СведенияОНезачисленнойЗарплатеПоВедомости.Количество() <> 0 
		И (СведенияОНезачисленнойЗарплатеПоВедомости.Количество() > 1 ИЛИ СведенияОНезачисленнойЗарплатеПоВедомости[0] <> Ссылка) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По документу %1 уже введены сведения о незачисленной зарплате.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Физлица = Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если Не Отказ И Физлица.Количество() > 0 Тогда
		
		// Отключение контроля соответствия начислений и выплат 
		// Регистрация незачисленной зарплаты не является ни начислением, ни выплатой.
		// Это своего рода сторнирующий документ: выплата не удалась, возвращаем сумму в зарплату к выплате.
		// Поэтому проверка тут не нужна
		КонтрольСоответствияНачисленийИВыплат.Отключить(Движения);
		
		// Взаиморасчеты
		ВзаиморасчетыССотрудниками.ЗарегистрироватьНевыплатуПоВедомости(Движения, Отказ, Ведомость, Физлица);
		
		// НДФЛ
		УчетНДФЛ.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		УчетФактическиПолученныхДоходовРасширенный.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
